Tomoooji/esp32-controller/src/ESP32Controller_Serial.h
/**
 * @file ESP32Controller_Serial.h
 * @brief シリアル通信(UART)で構造体をやり取りするライブラリ
 * 
 * @note 
 * 
 * @author Tomoooji (https://github.com/Tomoooji)
 * @version 2.0.0
 * @date 2026-09-25
 * @copyright Copyright (c) 2026
 */

#pragma once
#ifdef ESP32
#include "ESP32Controller_Base.h"

namespace ESP32ControllerInternal {

/**
 * @brief シリアル通信(UART)で構造体を受け取るクラス
 * 
 * @tparam InputData 相手から受け取るデータ(構造体)
 * @attention InputDataは__attribute__((__packed__))を付けて宣言し、パディングを無効化すること
 */
template <HardwareSerial &Serial, typename InputData>
class ESP32Controller_Serial : public Base<ESP32Controller_Serial::Config, InputData> {
protected:
  HardwareSerial &serial_ = Serial;

public:
  /** @brief シリアル通信(UART)の設定 */
  struct Config : public Base<Config, InputData>::ConfigStruct {
    int baudrate = 115200;
    int Rx = -1;
    int Tx = -1;
  };
  
  using Base<Config, InputData>::Base;

  /**
   * @brief setup()で呼ばれる初期化関数
   * 
   * @retval true  初期化成功
   * @retval false 初期化失敗
   * @note SERIAL_8N1 = 8ビット、パリティなし、ストップビット1（8N1）
   */
  bool begin() override {
    this->serial_.begin(this->config_.baudrate, SERIAL_8N1, this->config_.Rx, this->config_.Tx);
    return this->serial_;
  }

  /**
   * @brief loop()内で呼ばれる値の更新を行う関数
   * @details データ量を指定して読み込み、余った分は捨てる
   * 
   * @retval true  更新あり
   * @retval false 更新なし
   */
  bool update() override {
    if (this->serial_.available() >= sizeof(InputData)) {
      this->serial_.readBytes(reinterpret_cast<uint8_t*>(&this->input_), sizeof(InputData));
      while(this->serial_.available() > 0) {
        this->serial_.read();
      }
      return true;
    }
    return false;
  }
};


//////////

/**
 * @brief シリアル通信(UART)で構造体を送受信するクラス
 * 
 * @tparam InputData  相手から受け取るデータ(構造体)
 * @tparam OutputData 相手に送るデータ(構造体)
 * @attention InputData,OutputDataは__attribute__((__packed__))を付けて宣言し、パディングを無効化すること
 */
template <HardwareSerial &Serial, typename InputData, typename OutputData>
class ESP32Controller_Response_Serial : public ResponseBase<ESP32Controller_Serial<Serial, InputData>, ESP32Controller_Serial<Serial, InputData>::Config, InputData, OutputData> {
public:
  using ResponseBase<ESP32Controller_Serial<Serial, InputData>, ESP32Controller_Serial<Serial, InputData>::Config, InputData, OutputData>::ResponseBase;

  bool send() const override {
    return this->serial_.write(reinterpret_cast<uint8_t*>(&this->output_), sizeof(OutputData)) == sizeof(OutputData);
  }
};

} // namespace ESP32ControllerInternal

template <HardwareSerial &Serial, typename InputData>
using ESP32Controller = ESP32ControllerInternal::ESP32Controller_Serial<Serial, InputData>;
template <HardwareSerial &Serial, typename InputData, typename OutputData>
using ESP32Controller_Response = ESP32ControllerInternal::ESP32Controller_Response_Serial<Serial, InputData,OutputData>;

#endif
